Revit 2024 API
DistanceMeasuredFrom Enumeration
 Indicates if the distance is measured from the top or bottom of the wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum DistanceMeasuredFrom
Visual Basic
Public Enumeration DistanceMeasuredFrom
Visual C++
public enum class DistanceMeasuredFrom
Members
Member name | Description
Base |  From bottom.
Top |  From top.
See Also
Autodesk.Revit.DB Namespace